<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PzBaseCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $categories = [
            'IT', '기술', '과학', '예술', '문화', '사회', '인문', '경제', '경영', '교육', '건강', '의학', '환경', '교통',
            '운송', '스포츠', '레저', '음식', '요리', '자연', '감정', '심리', '직업', '업무', '장소', '공간', '동식물', '역사', '철학', '법률', '국제관계', '세계사', '음악',
            '경영학', '경제학', '회계학', '국어국문학', '영어영문학', '심리학', '사회학', '정치외교학', '행정학', '법학', '교육학', '유아교육학', '특수교육학', '물리학', '화학', '생물학',
            '지구과학', '통계학', '수학', '정보통계학', '천문학', '컴퓨터학', '산업공학', '기계공학', '전자공학', '화학공학', '건축학', '토목공학', '환경공학', '신소재공학', '식품공학', '생명공학',
            '간호학', '의학', '치의학', '약학', '한의학', '수의학', '물리치료학', '작업치료학', '임상병리학', '방사선학', '스포츠의학', '체육학', '미술학', '디자인학', '음악학', '연극영화학', '무용학',
            '신학', '문헌정보학', '언론정보학', '광고홍보학', '사회복지학', '국제관계학', '경찰행정학', '소방행정학', '아동학', '가정학', '의류학', '식품영양학', '산림자원학', '조경학', '도시계획학',
            '지리학', '지질학', '해양학', '대기과학', '우주과학', '생태학', '고고학', '미술사학', '음악사학', '종교학', '윤리학', '미학', '논리학', '문화인류학', '미디어학', '커뮤니케이션학', '빅데이터학',
            '인공지능학', '로봇공학', '나노과학', '분자생물학', '유전공학', '뇌과학', '인지과학', '의료IT학', '패션디자인학', '실내건축학', '산업디자인학', '시각디자인학', '애니메이션학', '사진학',
            '공연예술학', '관광학', '호텔경영학', '외식경영학', '항공서비스학'
        ];

        foreach ($categories as $category) {
            DB::table('pz_base_categories')->insertOrIgnore([
                'category' => trim($category),
                'is_active' => true,
                'created_at' => now(),
                'updated_at' => now(),
            ]);
        }

        $this->command->info('카테고리 데이터가 성공적으로 삽입되었습니다.');
    }
}
